export const js_start_test = {
  id: 500,
  name: "Введение в программирование и JavaScript",
  category: "JavaScript",
  ques: [
    {
      id: 1,
      name: "Что такое программирование?",
      variants: [
        "Создание дизайна интерфейсов",
        "Процесс написания инструкций для компьютера",
        "Работа с базами данных",
      ],
      correct: [1],
    },
    {
      id: 2,
      name: "Какой язык вы будете изучать в этом курсе?",
      variants: ["Python", "Java", "JavaScript"],
      correct: [2],
    },
    {
      id: 3,
      name: "Где может использоваться JavaScript?",
      variants: [
        "Только в браузерах",
        "В браузерах, серверах, мобильных приложениях и автоматизации",
        "Только для анимаций на сайтах",
      ],
      correct: [1],
    },
    {
      id: 4,
      name: "Что нужно для запуска JavaScript в браузере?",
      variants: [
        "Открыть сайт и вкладку Console (F12)",
        "Установить специальный браузер",
        "Подключить сервер к браузеру",
      ],
      correct: [0],
    },
    {
      id: 5,
      name: "Какой редактор кода рекомендуется использовать в курсе?",
      variants: ["Sublime Text", "VS Code", "Notepad"],
      correct: [1],
    },
    {
      id: 6,
      name: "Что делает команда `console.log()`?",
      variants: [
        "Создаёт новый HTML-элемент",
        "Выводит сообщение в консоль",
        "Сохраняет данные на сервер",
      ],
      correct: [1],
    },
    {
      id: 7,
      name: "Какая команда используется для запуска JS-файла в Node.js?",
      variants: ["run index.js", "node index.js", "start js"],
      correct: [1],
    },
    {
      id: 8,
      name: "Какая организация занимается поддержкой сайта code.visualstudio.com?",
      variants: ["Mozilla", "Microsoft", "Google"],
      correct: [1],
    },
    {
      id: 9,
      name: "Что произойдёт при выполнении: `console.log('Привет, мир!')`?",
      variants: [
        "Ошибка выполнения",
        "Выведется сообщение в консоль",
        "Создастся кнопка на странице",
      ],
      correct: [1],
    },
    {
      id: 10,
      name: "Что можно сделать с помощью JavaScript (на уровне новичка)?",
      variants: [
        "Рисовать сайты без HTML и CSS",
        "Управлять логикой, выводить сообщения, работать с числами и строками",
        "Редактировать фотографии",
      ],
      correct: [1],
    },
  ],
};
