import { introHtmlChaptersData } from "./introHtmlChaptersData";

export const introHtml = {
  id: "introHtml",
  title: "Введение в курс",
  description:
    "Добро пожаловать на курс по вёрстке сайтов! Здесь вы с нуля освоите основы HTML — главного языка для создания структуры веб-страниц. Мы шаг за шагом разберём, как устроены современные сайты, научимся использовать базовые теги, создавать разметку для текста, изображений, ссылок и форм.\n\nКурс идеально подойдёт тем, кто делает первые шаги в веб-разработке: всё объясняется простым языком, без лишней теории. Вас ждут практические задания и примеры из реальных проектов, чтобы вы не только понимали, но и умели применять знания на практике.\n\nПосле этого модуля вы сможете создавать простые и понятные сайты, что станет отличной основой для дальнейшего изучения CSS и JavaScript.",
  estimatedHours: 1,
  practiceIds: [],
  chapters: introHtmlChaptersData,
  mentors: {
    id: 2,
    name: "Митин Олег",
  },
};
