export const ide_intro_test = {
  id: 300,
  name: "Основы Node.js, npm и IDE",
  category: "Настройка IDE",
  ques: [
    {
      id: 1,
      name: "Что такое Node.js?",
      variants: [
        "Графический редактор для интерфейсов",
        "Серверная среда для запуска JavaScript вне браузера",
        "Система управления версиями",
      ],
      correct: [1],
    },
    {
      id: 2,
      name: "Для чего нужен npm?",
      variants: [
        "Для рисования в браузере",
        "Для форматирования кода",
        "Для установки библиотек и пакетов JavaScript",
      ],
      correct: [2],
    },
    {
      id: 3,
      name: "Что из этого позволяет устанавливать React, Express, lodash и другие пакеты?",
      variants: ["npm", "VS Code", "HTML"],
      correct: [0],
    },
    {
      id: 4,
      name: "Какой командой можно проверить версию Node.js?",
      variants: ["node version", "node -v", "version node"],
      correct: [1],
    },
    {
      id: 5,
      name: "Что такое VS Code?",
      variants: [
        "Обычный текстовый редактор",
        "Онлайн-браузер",
        "Редактор кода с расширениями и поддержкой языков",
      ],
      correct: [2],
    },
    {
      id: 6,
      name: "Что такое IDE?",
      variants: [
        "Инструмент для редактирования видео",
        "Комплексная среда разработки",
        "Система проектирования дизайна",
      ],
      correct: [1],
    },
    {
      id: 7,
      name: "Можно ли использовать VS Code как IDE?",
      variants: [
        "Нет, только как блокнот",
        "Да, при установке расширений",
        "Только для Python",
      ],
      correct: [1],
    },
    {
      id: 8,
      name: "Что нужно установить, чтобы использовать npm?",
      variants: ["Только браузер", "Node.js", "Photoshop"],
      correct: [1],
    },
  ],
};
