export const ide_intro_test = {
  id: 101,
  name: "Настройка среды разработки",
  category: "Настройка IDE",
  ques: [
    {
      id: 1,
      name: "Что такое Node.js?",
      variants: [
        "Графический редактор для интерфейсов",
        "Серверная среда для запуска JavaScript вне браузера",
        "Система управления версиями",
      ],
      correct: [1],
    },
    {
      id: 2,
      name: "Для чего нужен npm?",
      variants: [
        "Для рисования в браузере",
        "Для форматирования кода",
        "Для установки библиотек и пакетов JavaScript",
      ],
      correct: [2],
    },
    {
      id: 3,
      name: "Как проверить версию Node.js?",
      variants: ["node -v", "npm --version", "check node"],
      correct: [0],
    },
    {
      id: 4,
      name: "Какой командой можно проверить версию Node.js?",
      variants: ["node version", "node -v", "version node"],
      correct: [1],
    },
    {
      id: 5,
      name: "Что такое VS Code?",
      variants: [
        "Обычный текстовый редактор",
        "Онлайн-браузер",
        "Редактор кода с расширениями и поддержкой языков",
      ],
      correct: [2],
    },
    {
      id: 6,
      name: "Что такое IDE?",
      variants: [
        "Инструмент для редактирования видео",
        "Комплексная среда разработки",
        "Система проектирования дизайна",
      ],
      correct: [1],
    },
    {
      id: 7,
      name: "Как быстро открыть файл в VS Code?",
      variants: [
        "Через меню 'Файл → Открыть'",
        "Перетащить файл в окно VS Code",
        "Оба варианта работают",
      ],
      correct: [2],
    },
    {
      id: 8,
      name: "Что нужно установить, чтобы использовать npm?",
      variants: ["Только браузер", "Node.js", "Photoshop"],
      correct: [1],
    },
  ],
};
