export const html_intro_test = {
  id: 1,
  name: "Введение в HTML",
  category: "HTML",
  ques: [
    {
      id: 1,
      name: "Что такое HTML?",
      variants: [
        "Язык программирования",
        "Язык разметки гипертекста",
        "Язык стилизации",
      ],
      correct: [1],
    },
    {
      id: 2,
      name: "Какой тег используется для создания заголовка?",
      variants: ["<p>", "<div>", "<h1>"],
      correct: [2],
    },
    {
      id: 3,
      name: "Что такое «разметка» в контексте HTML?",
      variants: [
        "Процесс написания стилей",
        "Описание структуры документа с помощью тегов",
        "Обработка пользовательского ввода",
      ],
      correct: [1],
    },
    {
      id: 5,
      name: "Какова роль HTML в frontend-разработке?",
      variants: [
        "Управление анимацией",
        "Формирование структуры и семантики страницы",
        "Управление базами данных",
      ],
      correct: [1],
    },
    {
      id: 6,
      name: "Какой элемент HTML содержит техническую информацию о странице?",
      variants: ["<body>", "<html>", "<head>"],
      correct: [2],
    },
    {
      id: 7,
      name: "В каком году был принят стандарт HTML5?",
      variants: ["2014", "2005", "1999"],
      correct: [0],
    },
    {
      id: 8,
      name: "Что такое HTML Living Standard?",
      variants: [
        "Новая версия HTML6",
        "Живой стандарт, который постоянно обновляется",
        "Ограниченный набор тегов HTML",
      ],
      correct: [1],
    },
    {
      id: 10,
      name: "Какую роль выполняет JavaScript во взаимодействии с HTML?",
      variants: [
        "Добавляет стили элементам HTML",
        "Создает структуру страницы",
        "Добавляет динамическое поведение и обработку событий",
      ],
      correct: [2],
    },
  ],
};
