export const featuresdata = [
  {
    title: "Флэшбек",
    description:
      "Помочь пользователю регулярно возвращаться к уже изученному материалу для закрепления знаний и долговременного запоминания.",
  },
  {
    title: "Вайб-кодинг",
    description:
      "Формат совместной разработки в расслабленной атмосфере. Пишем код вместе, обсуждаем задачи и обмениваемся опытом",
  },
  {
    title: "Проекты",
    description:
      "Дополнительные видеоуроки и кейсы из реальных проектов. Это задачи для портфолио, которые можно сделать, применяя современные технологии.",
  },
  {
    title: "Челлендж",
    description:
      "Практические задания с реальными сценариями — отличная возможность отработать навыки. Уровни сложности варьируются от новичка до профи.",
  },
  {
    title: "Собеседование",
    description:
      "Подготовка к техническим собеседованиям: частые вопросы, ответы, теоретические блоки, практические задачи. Формат — в виде карточек с фильтрами по темам.",
  },
  {
    title: "Задачник",
    description:
      "Коллекция алгоритмических и практических задач для прокачки логики и навыков решения реальных проблем. Есть разные уровни сложности, система оценки и история попыток.",
  },
  {
    title: "Мини-игры",
    description:
      "Интерактивные игры для изучения тем с проверкой знаний в игровой форме.",
  },
  {
    title: "Готовые шпаргалки",
    description:
      "Сборник полезных шпаргалок по HTML, CSS, JavaScript и другим технологиям для быстрого поиска нужных знаний.",
  },
];
